# _*_coding:utf-8 _*_
# from seq2seq.evaluator import Predictor
import torch
import json
import sys
from seq2seq.util.checkpoint import Checkpoint
from batch_predictor import Batch_Predictor

# checkpoint = Checkpoint.load("./experiment1/checkpoints/2018_12_05_11_06_14")
# model = checkpoint.model
# bl_vocab = checkpoint.input_vocab1
# jz_vocab = checkpoint.input_vocab2
# label1_vocab = checkpoint.output_vocab1
# label2_vocab = checkpoint.output_vocab2
# # torch.save(model, "testjson.model")
# # torch.save(input_vocab1, "testbl.input_vocab")
# # torch.save(input_vocab2, "testjz.input_vocab")
# # torch.save(output_vocab1, "testlabel1.input_vocab")
# # torch.save(output_vocab2, "testlabel2.input_vocab")
model = torch.load("./models/model.model")
bl_vocab = torch.load("./models/bl.input_vocab")
# jz_vocab = torch.load("./models/jz.input_vocab")
label1_vocab = torch.load("./models/label1.input_vocab")
label2_vocab = torch.load("./models/label2.input_vocab")
label3_vocab = torch.load("./models/label3.input_vocab")
# predictor = Predictor(model, bl_vocab, label1_vocab, label2_vocab)

# while True:
#     seq_str1 = input("Type in a source bl sequence:")
#     seq1 = seq_str1.strip().split()
#     seq_str2 = input("Type in a source jz sequence:")
#     seq2 = seq_str2.strip().split()
#     print(predictor.predict(seq1, seq2))

labels_right1 = []
labels_right2 = []
labels_right3 = []
labels_predictor1 = []
labels_predictor2 = []
labels_predictor3 = []
texts_bl = []
# texts_jz = []

with open("./data/source_test.json", 'r', encoding='utf-8') as fr:
    for line in fr:
        line = json.loads(line)
        texts_bl.append(line['bl'])
        # texts_jz.append(line['jz'])
        labels_right1.append(line['label'])
        labels_right2.append(line['label2'])
        labels_right3.append(line['label3'])

# seq2 = seq_str2.strip().split()
predict = Batch_Predictor(model, bl_vocab, label1_vocab, label2_vocab, label3_vocab)
labels_predictor = predict.predict_cut_textlist(texts_bl)
# predict_label1, predict_label2 = predictor.predict(seq1)
for label in labels_predictor:
    labels_predictor1.append(" ".join(str(i) for i in set(label[0])))
    labels_predictor2.append(" ".join(str(i) for i in set(label[1])))
    labels_predictor3.append(" ".join(str(i) for i in set(label[2])))

frr = open('result.txt', 'a')
sys.stdout = frr

a = labels_predictor1
bel = list(set(a))
print(bel)
print(len(a))

rr3, pp3, ff3 = 0, 0, 0
text_labels = list(set(labels_right1))
A = dict.fromkeys(text_labels, 0)  #预测正确的各个类的数目
B = dict.fromkeys(text_labels, 0)   #测试数据集中各个类的数目
C = dict.fromkeys(bel, 0) #预测结果中各个类的数目
for i in range(0, len(labels_right1)):
    B[labels_right1[i]] += 1
    C[a[i]] += 1
    if labels_right1[i] == a[i]:
        A[labels_right1[i]] += 1

print("预测正确的各个类的数目:");print(A)
print("测试数据集中各个类的数目:");print(B)
print("预测结果中各个类的数目:");print(C)
#计算准确率，召回率，F值
for key in B:
    try:
        r = float(A[key]) / float(B[key])
        p = float(A[key]) / float(C[key])
        f = p * r * 2 / (p + r)
        rr3 += r * B.get(key, 0) / len(a)
        pp3 += p * B.get(key, 0) / len(a)
        ff3 += f * B.get(key, 0) / len(a)
        # print(("%s:\t p:%f\t r:%f\t f:%f") % (key,p,r,f))
        print(key, "right:", A.get(key, 0), "real:", B.get(key, 0), "predict:", C.get(key, 0), ("p: %f\t r: %f\t f: %f") % (p, r, f))
    except:
        print(("error:" + key), "right:", A.get(key, 0), "real:", B.get(key, 0), "predict:", C.get(key, 0))

print(("mean_p: %f\t mean_r: %f\t mean_f: %f") % (pp3, rr3, ff3))

b = labels_predictor2
bel = list(set(b))
print(bel)
print(len(b))

rr3, pp3, ff3 = 0, 0, 0
text_labels = list(set(labels_right2))
A = dict.fromkeys(text_labels, 0)  #预测正确的各个类的数目
B = dict.fromkeys(text_labels, 0)   #测试数据集中各个类的数目
C = dict.fromkeys(bel, 0) #预测结果中各个类的数目
for i in range(0, len(labels_right2)):
    B[labels_right2[i]] += 1
    C[b[i]] += 1
    if labels_right2[i] == b[i]:
        A[labels_right2[i]] += 1

print("预测正确的各个类的数目:");print(A)
print("测试数据集中各个类的数目:");print(B)
print("预测结果中各个类的数目:");print(C)
#计算准确率，召回率，F值
for key in B:
    try:
        r = float(A[key]) / float(B[key])
        p = float(A[key]) / float(C[key])
        f = p * r * 2 / (p + r)
        rr3 += r * B.get(key, 0) / len(a)
        pp3 += p * B.get(key, 0) / len(a)
        ff3 += f * B.get(key, 0) / len(a)
        # print(("%s:\t p:%f\t r:%f\t f:%f") % (key,p,r,f))
        print(key, "right:", A.get(key, 0), "real:", B.get(key, 0), "predict:", C.get(key, 0), ("p: %f\t r: %f\t f: %f") % (p, r, f))
    except:
        print(("error:" + key), "right:", A.get(key, 0), "real:", B.get(key, 0), "predict:", C.get(key, 0))

print(("mean_p: %f\t mean_r: %f\t mean_f: %f") % (pp3, rr3, ff3))

c = labels_predictor3
bel = list(set(c))
print(bel)
print(len(c))

rr3, pp3, ff3 = 0, 0, 0
text_labels = list(set(labels_right3))
A = dict.fromkeys(text_labels, 0)  #预测正确的各个类的数目
B = dict.fromkeys(text_labels, 0)   #测试数据集中各个类的数目
C = dict.fromkeys(bel, 0) #预测结果中各个类的数目
for i in range(0, len(labels_right3)):
    B[labels_right3[i]] += 1
    C[c[i]] += 1
    if labels_right3[i] == c[i]:
        A[labels_right3[i]] += 1

print("预测正确的各个类的数目:");print(A)
print("测试数据集中各个类的数目:");print(B)
print("预测结果中各个类的数目:");print(C)
#计算准确率，召回率，F值
for key in B:
    try:
        r = float(A[key]) / float(B[key])
        p = float(A[key]) / float(C[key])
        f = p * r * 2 / (p + r)
        rr3 += r * B.get(key, 0) / len(a)
        pp3 += p * B.get(key, 0) / len(a)
        ff3 += f * B.get(key, 0) / len(a)
        # print(("%s:\t p:%f\t r:%f\t f:%f") % (key,p,r,f))
        print(key, "right:", A.get(key, 0), "real:", B.get(key, 0), "predict:", C.get(key, 0), ("p: %f\t r: %f\t f: %f") % (p, r, f))
    except:
        print(("error:" + key), "right:", A.get(key, 0), "real:", B.get(key, 0), "predict:", C.get(key, 0))

print(("mean_p: %f\t mean_r: %f\t mean_f: %f") % (pp3, rr3, ff3))

# sys.stdout = origin
frr.close()

# jq_type = {"50610006": "故意损坏财物", "00010005": "盗窃车内财物", "0006": "纠纷", "0030000300200011000200010002": "求助借款", "003000030010001200020099": "其他名目", "003000030010001200040099": "其他名目", "00050002": "殴打他人等", "003000030020001200010001": "完成一定任务再返还", "06000016": "其它求助", "020109E2": "拒绝、妨碍依法执行职务", "00010015": "其他盗窃", "003000030010001300010001": "退款", "50610003": "寻衅滋事", "02010964": "故意损毁财物", "000100030003": "盗窃电动车", "09000099": "其他案由", "02010943": "猥亵", "00010001": "扒窃", "00040001": "赌博", "000100030002": "盗窃摩托车", "020109D8": "收购有赃物嫌疑的物品", "00300001000200010003": "交友型", "02010809": "非法侵入住宅", "020109B6": "擅自经营需公安机关许可的行业", "0030000100090001": "祈福消灾", "00300003004000110099": "其他方式", "00300003001000160005": "代办信用卡/贷款", "000100030004": "盗窃自行车", "00300003004000110003": "网络支付盗刷", "01060622": "盗伐林木案", "003000030020001400060001": "付款后无法联系", "003000030020001400990099": "其他名目", "000800020001": "飞车抢夺", "10000099": "其他警情处理", "00300003002000150002": "求助借款", "0030000300200011000100010003": "帮订机票", "10000002": "取消报警", "003000030010001300990001": "退款", "00030001": "吸毒", "01060612": "非法收购珍贵、濒危野生动物及其制品案", "00010002": "入室盗窃", "01050303": "盗刷银行卡", "003000030030001100050001": "联系客服电话", "01030710": "销售假冒注册商标的商品案", "003000030020001300040003": "付款后无法联系", "000100040004": "盗窃柴油", "003000030020001400060002": "押金/保证金/资料费", "10000001": "重复报警", "01050600": "职务侵占案", "003000030020001400050001": "付款后无法联系", "003000030020001300010003": "付款后无法联系", "00300003001000110003": "金融部门/银行", "003000030020001300010099": "其他名目", "0030000100150001": "摩托车", "00020001": "拉客招嫖", "00030003": "贩毒", "00010010": "盗窃店内财物", "02011301": "无驾驶证驾驶机动车辆", "00030004": "持毒", "00300001000600010002": "购物", "02010404": "非法侵入他人住宅", "0030000100030006": "公共场所推销商品", "003000030010001200030001": "疏通关系", "003000030010001300010002": "解除客户身份绑定", "00300003002000990002": "信用账号套现", "003000030020001200010099": "其他名目", "003000030020001300990007": "钓鱼网页虚假网站", "02011103": "阻碍执行职务", "00300001000200010001": "港澳台胞", "003000030020001300990099": "其他名目", "003000030020001300030099": "其他名目", "0030000300200011000100010002": "求助借款", "00300003004000110005": "绑定消费账号被盗", "003000030010001300050099": "其他名目", "0030000100030001": "手机调包", "01060101": "阻碍执行职务案", "000100040003": "盗窃电池", "003000030020001400060099": "其他名目", "00300003001000110099": "其他名义", "01020699": "其它违反危险物品管理案", "003000030020001300020003": "付款后无法联系", "01030611": "虚开增值税发票用于骗取出口退税、抵扣税款发票案", "05000011": "轻微交通事故", "00300003001000110006": "办案单位", "01050900": "故意毁坏财物案", "003000030020001300990005": "引诱支付回扣", "00040002": "为赌博提供条件", "02010317": "故意损坏公私财物", "003000030020001400020001": "付款后无法联系", "00300001000200040001": "街头求助", "00300003002000990099": "其他名目", "01030805": "合同诈骗案", "003000030030001100010001": "联系客服电话", "02011573": "饲养动物干扰正常生活", "02010213": "非法储存危险物质", "02011199": "其他违反消防管理", "00300003002000150099": "其他名目", "0030000100030011": "消毒水", "11000005": "精神病人报警", "003000010021": "其他", "00300001000500010001": "固定商铺", "00050003": "故意伤害", "00300003001000160099": "其他名目", "000100040001": "盗窃车牌", "00300003002000160001": "色情服务", "0030000300200011009900010003": "帮订机票", "020109D9": "收购国家禁止收购的其他物品", "003000030020001300010005": "引诱支付回扣", "02010408": "威胁他人安全", "06000001": "寻物", "0030000100030012": "其他", "003000030020001300990003": "付款后无法联系", "003000030020001300010002": "押金/保证金", "003000030020001300990001": "资金解冻/激活", "003000030020001300030003": "付款后无法联系", "00300003002000160099": "其他名目", "00300001000100030002": "违法释放", "00300003004000110001": "境外盗刷", "003000030020001300010001": "资金解冻/激活", "0030000300400013": "卡丢失或遗失", "0001001300040001": "盗窃电线（缆）", "003000030010001300990003": "提高信用卡额度", "003000030010001300990099": "其他名目", "003000030010001300010099": "其他名目", "00300003002000150001": "送礼", "003000030010001300050001": "退款", "00020003": "组织、强迫、引诱、容留、介绍卖淫", "0030000100170003": "培训费", "00020002": "卖淫嫖娼", "003000030010001200030099": "其他名目", "0030000100020003": "借骗车辆", "01060614": "非法出售珍贵、濒危野生动物及其制品案", "003000030010001200020003": "违法行为担保/罚款", "0001001400010002": "盗狗", "02010963": "敲诈勒索（治安）", "01040105": "强奸案", "0001001300040004": "盗窃通信基站设备", "003000030020001200990002": "培训费/保证金", "003000030020001400020099": "其他名目", "00300003003000120099": "其他名目", "02010942": "猥亵/裸露行为", "000100140004": "撬盗储物柜", "00300003004000110006": "POS机盗刷", "01030701": "假冒注册商标案", "000800010007": "其它抢劫", "00300003001000160003": "代办证件发票", "11000099": "其它无效报警", "000100040006": "盗窃轮胎", "0030000100040007": "租赁", "003000030020001400030001": "付款后无法联系", "0001001400010006": "盗其他动物", "003000030020001400040001": "付款后无法联系", "003000030020001200010002": "培训费/保证金", "0001000300010001": "盗窃小轿车", "003000030020001400030099": "其他名目", "0030000100040009": "工程建设", "0030000100040010": "设局骗钱类", "02010930": "侵犯隐私", "01030806": "非法经营案", "00030007": "吸贩毒", "00300003001000110001": "通管部门/运营商", "0030000100040011": "中介服务", "003000030020001300060003": "付款后无法联系", "02011311": "饮酒后驾驶机动车辆", "02010808": "非法限制人身自由", "00300001000600010001": "出租车", "000800020002": "徒步抢夺", "02010399": "其他妨害社会管理", "003000030010001200030002": "意外事故求助", "01030510": "集资诈骗案", "003000030030001100040003": "回复短信", "02010102": "扰乱公共场所秩序", "003000030020001300060002": "押金/保证金", "00300003001000160004": "生意加盟", "0030000100040015": "贷款", "00300003001000990099": "其他名目", "0030000300400099": "其他信用卡诈骗", "0030000100070002": "碰瓷", "00300001000200010005": "生意型", "003000030010001200020001": "疏通关系", "02010985": "使用伪造的证件", "00300001000100040001": "银行卡业务", "0030000300300099": "其他短信诈骗", "0001001400010004": "盗家禽", "003000030020001400030003": "钓鱼网页/虚假网站", "0030000100040018": "其他类别", "003000030010001300040099": "其他名目", "003000030020001400040099": "其他名目", "00300001000200010004": "招工型", "0030000300200011000200010003": "帮订机票", "003000030010001200040001": "疏通关系", "0030000100030002": "充值卡", "0030000100180002": "列车晚点", "003000030010001300030001": "退款", "003000030020001200020001": "完成一定任务再返还", "00300003002000140006": "代办信用卡/贷款", "0030000300200011000100050099": "其他名目", "003000030020001400050004": "指引到柜员机/网银操作", "00300001000200020003": "交友型", "05000008": "乱停乱放", "003000030030001100990001": "联系客服电话", "0001001400010005": "盗水产品", "003000030020001400020003": "钓鱼网页/虚假网站", "003000030020001300990002": "押金/保证金", "0030000100100004": "其他消费", "01020105": "危险驾驶案", "003000030010001300030099": "其他名目", "0030000300200011000100990002": "求助借款", "00300001000400130001": "网络建设", "0030000100030003": "门票", "00300001000500010003": "出租车", "00020004": "制作、复制、出版、贩卖、传播淫秽物品", "000100040002": "盗窃后视镜", "0030000100140001": "棋局", "0030000300200011000200010099": "其他名目", "02011568": "冒用他人户口证件、居民身份证", "003000030020001400060004": "指引到柜员机/网银操作", "0001000300010002": "盗窃面包车", "00300003004000110002": "境内商店盗刷", "0030000100170001": "押金收费", "003000030020001300050005": "引诱支付回扣", "003000030020001300060099": "其他名目", "0030000100110002": "报刊杂志", "003000030020001300020099": "其他名目", "02010917": "故意损毁公用设施", "000800010003": "抢劫汽车", "0030000100040017": "套现信用卡", "0030000100130003": "现金", "02010405": "公然侮辱他人", "000800010006": "在公共交通工具上抢劫", "00300001000200020005": "生意型", "02011221": "违反监督管理规定", "000100040009": "盗窃其他车辆附属物", "0030000300200011000100010001": "充话费", "02010101": "扰乱单位秩序", "02010369": "公共场所经营管理人员违反安全规定", "003000030010001200020002": "意外事故求助", "003000030030001100060099": "其他方式", "003000030010001200060001": "疏通关系", "0030000100130006": "其他", "003000030010001200010002": "意外事故求助", "003000030030001100060001": "联系客服电话", "003000030010001200060099": "其他名目", "0030000100180005": "代购车票", "00300001000200020001": "港澳台胞", "0001001300040005": "盗窃其他三电设备", "0030000100030004": "购买游戏装备", "003000030020001300060007": "钓鱼网页虚假网站", "0030000100110007": "其他", "02011543": "非法持有毒品", "00300001000400130003": "安装宽带", "01060745": "容留他人吸毒案", "003000030030001100020002": "点击链接填写信息", "01030560": "信用卡诈骗案", "02010915": "以滋扰他人的方式乞讨", "01040110": "绑架案", "50610001": "强迫交易", "02010214": "非法运输危险物质", "02010403": "非法限制他人人身自由", "0030000100220003": "企事业单位人员", "003000030020001300020002": "押金/保证金", "01060702": "贩卖毒品案", "02010407": "虐待家庭成员", "003000030010001300020001": "退款", "0030000100100003": "机票车费", "00300001000200010002": "大学生", "00010006": "盗窃工地设备材料", "020109E9": "其他妨害社会管理秩序", "0030000300200011000100010099": "其他名目", "003000030020001400990001": "付款后无法联系", "003000030010001200990099": "其他名目", "0030000100040006": "购销", "000800010001": "入屋抢劫", "0030000100130002": "钱包", "02010944": "在公共场所故意裸露身体", "003000030020001400060003": "钓鱼网页/虚假网站", "0030000300200011000200990099": "其他名目", "01021003": "非法运输危险物质案", "00300001000500020001": "美元", "0030000300200011000100030001": "充话费", "0030000300200011000100020001": "充话费", "00300003002000160002": "赌球博彩六合彩", "003000030020001400050099": "其他名目", "0001000300010005": "盗窃货车", "0030000100130005": "手机", "000800010002": "拦路抢劫", "01030804": "串通投标案", "0030000300200011000100990003": "帮订机票", "0030000100180001": "带路乘车", "0030000100030010": "汽车买卖", "0030000300200011000300020005": "更改收款账户", "00020007": "站街招嫖", "003000030020001300020004": "货不对板不退款", "003000030010001200010099": "其他名目", "003000030020001400990002": "押金/保证金/资料费", "003000030030001100060003": "回复短信", "0030000300200011000100990099": "其他名目", "0030000100030005": "商场购物调包", "00300003001000170001": "色情服务", "0105012C": "抢劫电动车案", "00300001000500020003": "加币", "003000030030001100030002": "点击链接填写信息", "003000030020001300050003": "付款后无法联系", "02010965": "招摇撞骗(治安)", "003000030010001400040003": "教育退费", "09000009": "虚假报警", "01060113": "伪造、变造居民身份证案", "00300001000500020005": "港币", "02010921": "威胁人身安全", "06000017": "其它咨询", "00300003003000150099": "其他名目", "003000030010001200990001": "疏通关系", "003000030020001400050003": "钓鱼网页/虚假网站", "003000030010001300040003": "提高信用卡额度", "0030000300200011000100010004": "交补习费", "0030000100110001": "网络", "00300003004000110007": "ATM取款", "020109C9": "不按规定登记承租人信息", "003000030010001200990003": "违法行为担保/罚款", "00300001000800010001": "流动摊档", "0030000300400012": "冒用身份办卡", "000100040008": "盗窃车标", "003000030020001400990003": "钓鱼网页/虚假网站", "003000030020001400990004": "指引到柜员机/网银操作", "003000030020001400050002": "押金/保证金/资料费", "00300003002000150004": "投资办事", "003000030020001300060001": "资金解冻/激活", "00300001000400130004": "运输物流", "0030000100200001": "招嫖", "00300003002000150003": "充话费", "0030000300200011000200050002": "求助借款", "003000030020001400020004": "指引到柜员机/网银操作", "12000023": "生活噪音", "003000030020001300040002": "押金/保证金", "003000030010001300010005": "优惠送礼", "003000030020001400070002": "押金/保证金/资料费", "00300001000800020003": "积分兑换", "00030006": "为吸毒提供条件", "00300003003000130099": "其他名目", "0030000100140004": "赌博出千", "003000030020001200020002": "培训费/保证金", "003000030020001400070099": "其他名目", "00300003001000160002": "股票期货投资", "0030000100040014": "加盟", "003000030030001100040001": "联系客服电话", "00300001000100020001": "入户", "003000030020001300990004": "货不对板不退款", "50610002": "敲诈勒索", "02010402": "殴打他人", "003000030020001200040002": "培训费/保证金", "000100040005": "盗窃汽油", "0030000300200011000200990005": "更改收款账户", "01030132": "生产、销售有毒、有害食品案", "50610005": "非法拘禁", "19020299": "其他交通事故", "0030000100220001": "亲友", "000800010004": "抢劫摩托车", "003000030020001300010006": "引诱提供付款卡密", "02011111": "指使他人违反消防安全规定冒险作业", "00300001000400010003": "非法集资", "02010212": "非法买卖危险物质", "01020711": "重大劳动安全事故案", "02010320": "损毁公共设施", "00300003001000130099": "其他客服", "02011699": "其他违反互联网信息相关管理规定", "003000030020001400020002": "押金/保证金/资料费", "02011314": "驾驶机动车违反装载规定", "01030720": "非法制造的注册商标标识案", "02010989": "使用伪造的证明文件", "003000030030001100040002": "点击链接填写信息", "00300003004000110004": "登陆电子银行账户操作", "00300001000400010001": "股票投资", "01050800": "敲诈勒索案", "0030000100100002": "餐饮食宿", "00300003001000170002": "赌球博彩六合彩", "003000030010001300020003": "提高信用卡额度", "00300001000400010002": "理财产品", "0030000300500013": "亲友介绍", "003000030010001300020099": "其他名目", "01050500": "侵占案", "01021004": "非法储存危险物质案", "003000030010001200040002": "意外事故求助", "02011110": "过失引起火灾", "00300003002000990001": "店铺激活保证金", "02010409": "干扰他人正常生活", "003000030020001200020099": "其他名目", "02011599": "其他违法行为", "01030101": "生产、销售伪劣产品案", "003000030030001100990099": "其他方式", "003000030010001200060002": "意外事故求助", "02010416": "寻衅滋事", "0030000300200011000100030002": "求助借款", "003000030020001300030002": "押金/保证金", "000800010005": "抢劫其它车辆", "00300003002000130001": "游戏装备/充值点券", "003000030010001400060006": "保险理赔", "003000030020001400010002": "押金/保证金/资料费", "0030000100010005": "工作调动", "003000030030001100040099": "其他方式", "09000001": "经济纠纷", "003000030020001300010007": "钓鱼网页虚假网站", "00300001000500020007": "其他币种", "02011216": "提供虚假证言", "00020006": "为淫秽活动提供条件", "0030000300500099": "其他方式", "02011217": "谎报案情", "003000030020001300050099": "其他名目", "00300003002000160005": "侦探定位", "01020703": "交通肇事案", "01051200": "拒不支付劳动报酬案", "003000030020001400030002": "押金/保证金/资料费", "0030000300200011000100990005": "更改收款账户", "02010210": "非法制造、买卖、储存、运输、邮寄、携带、使用、提供、处置危险物质", "0030000100200002": "按摩", "020109C4": "不按规定登记住宿旅客信息", "02010117": "扬言实施放火、爆炸、投放危险物质扰乱公共秩序", "01030440": "持有、使用假币案", "02010199": "其他扰乱公共秩序", "01060224": "掩饰、隐瞒犯罪所得、犯罪所得收益案", "02050019": "冒用他人或使用伪造身份证件登机", "00300001000100010001": "驾证违章", "02010968": "买卖、使用伪造、变造的公文、证件、证明文件", "02010920": "威胁/侮辱/诽谤/诬告/侵犯私隐私生活", "01030808": "组织、领导传销活动案", "003000030020001400010001": "付款后无法联系", "02010415": "妨碍交通工具正常行驶", "02010923": "诽谤", "0030000300200011000200020099": "其他名目", "0030000300200011000300990099": "其他名目", "01040108": "猥亵儿童案", "02011202": "转移依法扣押的财物", "0030000100150002": "汽车", "01060115": "非法买卖警服、警用标志、警械案", "01020704": "重大责任事故案", "01040109": "非法拘禁案", "003000030020001300010004": "货不对板不退款", "003000030010001200050099": "其他名目", "02010499": "其他侵犯他人人身权利、财产权利", "003000030020001300060004": "货不对板不退款", "02010104": "煽动扰乱社会秩序", "02012199": "其他违反场所特业管理规定", "02010368": "违反规定举办大型活动", "00300001000800010002": "固定商铺", "01030520": "贷款诈骗案", "000100140002": "盗窃船只及附属物", "50610009": "开设赌场", "003000030020001400010099": "其他名目", "02010976": "伪造印章", "01020101": "放火案", "003000030010001200030003": "违法行为担保/罚款", "19010099": "其他火灾", "0030000300500015": "传单标贴", "0030000100030009": "上门办理业务", "003000030020001400030004": "指引到柜员机/网银操作", "00300003003000150001": "股票投资", "0030000100180003": "拉客", "003000030020001100990001": "冒充亲友", "01040112": "拐卖妇女、儿童案", "01060199": "其它扰乱公共秩序案", "0030000300500011": "取款机故障", "01060241": "非法处置查封、扣押、冻结财产案", "0030000300200011009900010099": "其他名目", "00300003001000990001": "代孕求子", "003000030010001300990005": "优惠送礼", "01020410": "非法储存爆炸物案", "00300001000200040002": "租车运货", "02010970": "伪造证件", "01020203": "破坏电力设备案", "00030002": "制毒", "02010299": "其他妨害公共安全", "0030000300200011009900060005": "更改收款账户", "00300001000600030003": "毕业证", "01060109": "伪造、变造公文证件印章案", "01060870": "传播性病案", "0106019A": "开设赌场案", "00030005": "供毒", "0030000100040004": "电子元件类", "0030000300200011000100020099": "其他名目", "01030780": "侵犯商业秘密案", "01030454": "非法吸收公众存款案", "000100140003": "盗窃室外空调主机", "01021002": "非法买卖危险物质案", "0030000300200011009900010002": "求助借款", "01030105": "生产、销售伪劣农药案", "01020207": "破坏公用电信设施案", "02010983": "买卖伪造的证件", "06000015": "交通求助", "01060231": "拒不执行判决、裁定案", "0001001400010003": "盗羊", "50610004": "聚众斗殴", "01060703": "运输毒品案", "003000030010001300020002": "解除客户身份绑定", "00300001000100010004": "营业执照/卫生许可证", "50610010": "绑架", "01040420": "重婚案", "0030000300200011000100020005": "更改收款账户", "01060122": "破坏计算机信息系统案", "01050710": "挪用资金案", "01030621": "非法出售增值税专用发票案", "01020119": "过失以其他危险方法危害公共安全案", "01060604": "污染环境案", "01030740": "销售非法制造的注册商标标识案", "02010205": "非法携带管制器具", "020109D2": "典当/收购违规行为", "0001000300010006": "盗窃其他车辆", "020109D6": "违法收购废旧专用器材", "003000030010001200020004": "孩子意外就医", "01020111": "失火案", "02012499": "其他违反暂住人口、租赁房屋管理规定", "000100130005": "盗窃城建设施", "50610011": "涉枪", "003000030010001200050001": "疏通关系", "003000030020001200990001": "完成一定任务再返还", "0030000100220002": "保险公司", "003000030020001200040099": "其他名目", "00300003002000160006": "作弊软件", "003000030020001200990099": "其他名目", "0001001400010001": "盗牛", "003000030020001100010001": "冒充亲友", "003000030010001300050003": "提高信用卡额度", "003000030020001300040099": "其他名目", "0030000300200011000300990005": "更改收款账户", "00300001000100010003": "房产证", "01020511": "非法持有枪支弹药案", "50610007": "组织卖淫", "01040480": "组织未成年人进行违反治安管理活动案", "0030000100040008": "订餐", "0030000100170004": "服装费", "01040121": "诽谤案", "003000030020001300050007": "钓鱼网页虚假网站", "01020104": "投放危险物质案", "01040199": "其它侵犯人身权利案", "003000030010001500020002": "交保证金", "01040101": "故意杀人案", "003000030010001400010099": "其他名目", "003000030020001300020007": "钓鱼网页虚假网站", "0030000300200011000300010002": "求助借款", "00300003001000130005": "快递客服", "01030344": "非国家工作人员受贿案", "0030000300200011009900050005": "更改收款账户", "0030000300200011000100050002": "求助借款", "02010208": "非法贩卖管制刀具", "0030000300200011000200990002": "求助借款", "003000030020001400070001": "付款后无法联系", "01060132": "聚众扰乱社会秩序案", "00300001000100030003": "民事诉述", "09000004": "其它纠纷", "02010910": "非法乞讨", "003000030030001100050002": "点击链接填写信息", "00300001000500010002": "流动摊档", "00300003003000120004": "不雅照", "0030000100170005": "应聘离职", "0030000300200011000100040002": "求助借款", "003000010019": "传销", "00300003002000160004": "考题答案", "003000030030001100050099": "其他方式", "06000018": "自杀", "020109D7": "收购赃物", "01050399": "其它诈骗案", "010609C0": "贩卖淫秽物品牟利案", "0030000100040003": "废旧回收类", "01030807": "强迫交易案", "0030000300200011000300020099": "其他名目", "01060310": "偷越国(边)境案", "0001001300040003": "盗窃通讯光纤", "0030000300200011000200030002": "求助借款", "00300001000400130002": "维修类", "00300003003000130003": "更换电话号码", "02010209": "非法携带管制刀具", "02010216": "非法携带危险物质", "00300001000800020001": "彩票", "003000030010001200060004": "孩子出事送医", "00300003002000120099": "其他招工信息", "0001000300010003": "盗窃商务车", "0030000100100001": "休闲娱乐", "00300001000600030002": "身份证", "003000030010001500990002": "交保证金", "0030000300200013": "购物交易", "0030000100130001": "金砖", "00300003001000110004": "人社部门", "00300003003000130002": "冒充亲友提供汇款账号", "00300003002000130003": "二手车", "00300003001000160001": "推销保健药品", "02011799": "其他违反计算机信息系统安全保护管理规定", "0030000300200011000100050005": "更改收款账户", "003000030010001300990002": "解除客户身份绑定", "01060121": "非法侵入计算机信息系统案", "0030000300200011000100040004": "交补习费", "01060810": "强迫卖淫案", "01030580": "保险诈骗案", "003000030020001400010004": "指引到柜员机/网银操作", "00300001000800020002": "可乐瓶", "0030000300200011000200020002": "求助借款", "02010319": "盗窃、损毁公共设施", "003000030020001200040001": "完成一定任务再返还", "00300001000100010002": "护照", "02010115": "虚构事实扰乱公共秩序", "11000004": "玩电话", "01060137": "寻衅滋事案", "01030530": "票据诈骗案", "01060710": "非法持有毒品案", "0030000100120001": "医托", "0030000300200011000300010003": "帮订机票", "01049900": "其他侵犯公民人身权利、民主权利案", "003000030010001300010003": "提高信用卡额度", "02010217": "非法使用危险物质", "02010701": "非法侵入计算机信息系统", "05000099": "其它交通警情", "01060106": "招摇撞骗案", "0030000300200011000100030099": "其他名目", "003000030030001100010002": "点击链接填写信息", "0106063A": "非法占用农用地案", "01060625": "其他破坏森林资源案", "003000030020001400040002": "押金/保证金/资料费", "01020109": "以其他危险方法危害公共安全案", "0030000100120002": "酒托", "01040107": "强制猥亵、侮辱妇女案", "02011117": "有重大火灾隐患，经公安消防机构通知逾期不改正的", "01069900": "其他妨害社会管理秩序案", "01029900": "其他危害公共安全案", "08000099": "举报其他", "02011323": "无证驾驶、偷开航空器、机动船舶", "003000030010001300030004": "票务退改签", "01040103": "故意伤害案", "02010929": "发送信息干扰正常生活", "00300001000100020002": "移民", "003000030010001500010099": "其他名目", "003000030010001400990099": "其他名目", "00300001000500020004": "英镑", "01030448": "妨害信用卡管理案", "02011519": "传播淫秽信息", "06000003": "溺水", "02010204": "非法携带弹药", "02010904": "偷开他人机动车辆", "0030000300200011000100020003": "帮订机票", "02010973": "伪造证明文件", "02010967": "伪造、变造、买卖公文、证件、证明文件、印章", "0030000100070001": "制造交通事故", "02011114": "妨碍消防设施使用", "02010103": "扰乱公共交通工具上的秩序", "0030000300200011000200050099": "其他名目", "01040440": "虐待案", "01020401": "非法制造枪支弹药案", "003000030030001100990002": "点击链接填写信息", "01030102": "生产、销售假药案", "02011113": "堵塞消防车通道", "00300003003000130001": "冒充房东收租", "02010993": "倒卖有价票证", "01030450": "骗取贷款、票据承兑、金融票证案", "00300003002000130002": "手机数码/电器", "0030000300400011": "账户信息泄露/被复制", "0030000100030008": "显号软件", "00300003002000130099": "交易其他物品", "0030000300200011009900060099": "其他名目", "01051099": "其它破坏生产经营案", "01030345": "对非国家工作人员行贿案", "01060701": "走私毒品案", "01030601": "逃税案", "02011899": "其他违反警用器具、服装管理规定", "01050230": "盗窃保险柜案", "00300003002000140005": "生意加盟", "02010906": "被监管人违反监督管理规定", "01030411": "出售假币案", "01020712": "危险物品肇事案", "003000030020001300040001": "资金解冻/激活", "003000030020001200030002": "培训费/保证金", "00300003002000120001": "兼职刷单", "02011115": "挪用消防器材设备", "01060850": "容留卖淫案", "0030000300200011009900020005": "更改收款账户", "02011220": "代销赃物", "02010314": "侵犯公私财物", "003000030010001200020005": "虚报绑架", "01040118": "非法侵入住宅案", "01060222": "窝藏、包庇案", "0030000300200011009900020099": "其他名目", "02010202": "非法携带枪支、弹药、管制器具", "00300001000100030001": "取保候审", "02011601": "制作、发布、传播破坏国家宗教政策，宣扬邪教和封建迷信信息", "02010922": "侮辱", "02010918": "破坏草坪、花卉、树木", "0030000100130004": "首饰", "02020165": "违反其他法律法规", "01020405": "非法储存枪支弹药案", "0030000300200011000200030099": "其他名目", "003000030010001500010003": "承担法律责任", "003000030010001200050002": "意外事故求助", "0030000300300011": "业务通知", "0030000300200011000100030003": "帮订机票", "003000030020001300020001": "资金解冻/激活", "003000030020001300030007": "钓鱼网页虚假网站", "0030000300200011000300050005": "更改收款账户", "01060999": "其它制作、复制、出版、贩卖、传播淫秽物品牟利案", "0030000300200011000300050099": "其他名目", "01060144": "非法获取计算机信息系统数据、非法控制计算机信息系统案", "0030000300200011009900050002": "求助借款", "50610008": "强迫卖淫", "01060212": "帮助毁灭、伪造证据案", "0030000100030007": "驾车售物", "0030000300200011000300030003": "帮订机票", "020109E0": "结伙斗殴", "01060631": "非法捕捞水产品案", "01060623": "滥伐林木案", "01060704": "制造毒品案", "003000030020001300030004": "货不对板不退款", "01030477": "洗钱案", "02010401": "故意伤害", "02011501": "卖淫/嫖娼/拉客招嫖", "06000002": "开锁开门", "003000030020001400010003": "钓鱼网页/虚假网站", "003000030010001300040001": "退款", "01060550": "非法行医案", "01020408": "非法运输爆炸物案", "02010364": "故意损毁、故意移动道路施工安全防护设施", "0030000300200011009900030002": "求助借款", "003000030030001400010003": "承担法律责任", "00300001000600020001": "支票", "0030000100140003": "猜硬币诈骗", "01060110": "买卖公文、证件、印章案", "02020129": "非法聘用外国人", "04000099": "其它治安事件", "020109C7": "房屋出租违规行为", "02020150": "容留、藏匿非法入境、非法居留的外国人", "0030000100110006": "探亲送礼", "01020715": "消防责任事故案", "003000030030001100990003": "回复短信", "01030131": "生产、销售不符合食品安全标准的食品案", "00300003001000990002": "敲诈勒索", "0001001300040002": "盗窃变压器", "02010105": "聚众扰乱单位秩序", "0030000300200011009900040004": "交补习费", "003000030030001400010001": "缴纳税费", "12000001": "城市管理", "003000030020001300040007": "钓鱼网页虚假网站", "11000098": "骚扰电话", "02010206": "其他违反枪支管理规定", "003000030010001200990002": "意外事故求助", "02020180": "患有精神病", "01030841": "非法转让土地使用权案", "09000005": "发现尸体", "02010972": "买卖证件", "12000004": "交通稽查", "0030000100040012": "培训", "00300003002000160003": "仿真枪支", "0030000100090002": "神医治病", "003000030020001400040003": "钓鱼网页/虚假网站", "01030614": "虚开发票罪", "0030000300200011000300010099": "其他名目", "003000030030001100020099": "其他方式", "003000030010001500010001": "缴纳税费", "01040120": "侮辱案", "01020407": "非法买卖爆炸物案", "02010406": "捏造事实诽谤他人", "01030401": "伪造货币案", "003000030030001100060002": "点击链接填写信息", "00300003003000150002": "六合彩", "003000030020001400070003": "钓鱼网页/虚假网站", "003000030030001100030003": "回复短信", "00300003002000990003": "代孕求子", "01060134": "聚众扰乱公共场所秩序案", "01061002": "组织和利用邪教组织破坏法律实施案", "02010106": "聚众扰乱公共场所秩序", "003000030010001300040002": "解除客户身份绑定", "06000007": "报迷失人员", "01060139": "组织、领导黑社会性质组织案", "003000030030001100030099": "其他方式", "0030000100180004": "健康证", "003000030030001100030001": "联系客服电话", "003000030010001500990099": "其他名目", "00300003001000110005": "海关边检", "01060624": "非法收购、运输盗伐、滥伐的林木罪", "01040102": "过失致人死亡案", "003000030010001200010001": "疏通关系", "003000030020001300020005": "引诱支付回扣", "00300001000600020002": "票据", "0030000300200011009900010004": "交补习费", "02010705": "故意传播计算机破坏性程序", "02010118": "扬言实施爆炸质扰乱公共秩序", "02011508": "介绍卖淫", "01060299": "其它妨害司法案", "00300003001000130004": "通信运营商客服", "0030000100140002": "猜大小诈骗", "0030000100040005": "债权债务", "01071200": "冒充军人招摇撞骗案", "08000004": "举报涉黄", "01050225": "盗窃电动车案", "02010962": "抢夺（治安）", "0001000300010004": "盗窃吉普车", "003000030020001300020006": "引诱提供付款卡密", "01030760": "侵犯著作权案", "00300003001000120002": "亲友", "01040450": "遗弃案", "0030000300200016": "违法服务", "0030000300200011000100040099": "其他名目", "02012299": "其他违反枪支民爆危险物品管理法律法规", "0030000100170002": "男女公关", "01020713": "工程重大安全事故案", "003000030030001100010099": "其他方式", "02010218": "非法提供危险物质", "01060119": "非法使用窃听器材案", "020109C3": "旅馆业违规行为", "01060214": "妨害作证案", "01071600": "伪造、变造、买卖部队公文、证件、印章案", "01060136": "聚众斗殴案", "02012099": "其他违反外国人管理规定", "00300003002000140099": "其他名目", "02011566": "违反户口或者居民身份证管理", "01060131": "扰乱无线电通讯管理秩序案", "003000030020001300990006": "引诱提供付款卡密", "02010336": "盗窃、损毁、擅自移动铁路设施、设备、机车车辆配件、安全标志", "0030000100110003": "电话短信", "003000030030001100050003": "回复短信", "003000030010001400060099": "其他名目", "01060330": "运送他人偷越国(边)境案", "003000030010001300040005": "优惠送礼", "0030000300200011": "盗号/仿号", "01060320": "组织他人偷越国(边)境案", "19010199": "易燃易爆化学品类其他", "0030000300200011009900060003": "帮订机票", "02010948": "强迫交易", "01060135": "聚众扰乱交通秩序案", "003000030010001200990005": "虚报绑架", "19020603": "高空事故", "0030000300300015": "推销广告", "01060104": "阻碍安全机关、公安机关执行职务案", "003000030010001200040003": "违法行为担保/罚款", "02011531": "非法种植毒品原植物", "01030449": "窃取、收买、非法提供信用卡信息案", "00300001000200020004": "招工型", "02010947": "遗弃", "003000030010001500990003": "承担法律责任", "003000030020001100010005": "冒充领导", "02010940": "明知是伪造的人民币而使用", "020109D0": "明知承租人利用出租屋犯罪不报告", "02010924": "诬告陷害", "12000015": "救护", "0030000300200011000200010004": "交补习费", "01040119": "诬告陷害罪", "00300003001000130002": "银行客服", "0030000300200011000200050005": "更改收款账户", "0030000300100012": "冒充关系人", "01030376": "国有公司、企业、事业单位人员失职案", "01030604": "骗取出口退税案", "02010511": "利用邪教、会道门、迷信活动危害社会", "00300003001000110002": "邮政部门/快递公司", "00300003002000140002": "搜索客服资料", "01060730": "非法买卖制毒物品案", "02010501": "组织、教唆、胁迫、诱骗、煽动从事邪教、会道门活动", "00300001000500020002": "欧元", "01030334": "隐匿、故意销毁会计凭证、会计账簿、财务会计报告案", "0030000300200011000200010001": "充话费", "01030540": "金融凭证诈骗案", "02011559": "破坏他人坟墓", "003000030030001400990099": "其他名目", "0030000300200011009900050099": "其他名目", "0030000300200011000100990001": "充话费", "01070400": "破坏军事设施案", "003000030010001200010003": "违法行为担保/罚款", "00300001000600030001": "合同", "02010111": "扰乱大型文体活动秩序", "003000030020001300050001": "资金解冻/激活", "02010703": "非法改变计算机信息系统数据和应用程序", "0030000300500014": "电视书刊广告", "003000030010001500010002": "交保证金", "020109B7": "煽动、策划非法集会、游行、示威", "19040099": "公务执勤类其他", "0030000300200011009900060002": "求助借款", "00300003001000130001": "电商平台客服", "02012399": "其他违反居民身份证户口管理法律法规", "01030332": "妨害清算案", "02011310": "驾驶机件不合安全要求的机动车辆", "003000030020001300050006": "引诱提供付款卡密", "0030000300200011000200040004": "交补习费", "01020402": "非法买卖枪支弹药案", "01030615": "持有伪造的发票罪", "01060108": "冒充警察招摇撞骗案", "01020499": "其它非法制造，买卖，运输，邮寄，储存枪支弹药、爆炸物案", "003000030010001500020099": "其他名目", "01030801": "损害商业信誉案", "00300003002000140003": "股票期货投资", "08000007": "举报涉毒", "0030000300200011000300030099": "其他名目", "12000002": "工商管理", "02010925": "威胁、侮辱、殴打、打击报复证人及其近亲属", "00070003": "发现迷失人员", "10000003": "警情回复", "01060140": "参加黑社会性质组织案", "05000098": "交通重复报警", "02011602": "制作、发布、传播散布暴力、凶杀、恐怖或者教唆犯罪信息", "0030000300200011000100010005": "更改收款账户", "02010901": "倒卖票证", "0030000300500012": "中奖信函卡券", "003000030020001100990006": "冒充其他关系人", "003000030010001500990001": "缴纳税费", "003000030020001300050004": "货不对板不退款", "10000007": "维持秩序", "08000002": "案件线索", "01030352": "为亲友非法牟利案", "00070001": "拐卖妇女、儿童", "02011308": "违反交通规则造成交通事故", "010609D0": "传播淫秽物品牟利案", "01020601": "非法携带管制刀具危及公共安全案", "02010946": "虐待", "0030000300200011009900050003": "帮订机票", "000100130001": "盗窃公路设施", "12000011": "气体", "01040470": "组织残疾人、儿童乞讨案", "003000010016": "调换银行卡", "02011106": "冲闯警戒区", "02011317": "非机动车驾驶人员违反交通规则", "0030000300200011000100040005": "更改收款账户", "0030000300200011000100020002": "求助借款", "00300003002000110003": "公/私邮箱", "0030000300200011009900030099": "其他名目", "01030151": "生产、销售不符合安全标准的产品案", "02011603": "制作、发布、传播散布谣言，扰乱社会秩序，破坏社会稳定信息", "02011214": "隐匿证据", "0030000300200011000300020002": "求助借款", "07000029": "其它警务投诉", "0030000300200011009900030003": "帮订机票", "020109C2": "策划非法示威", "01030465": "利用未公开信息交易案", "01070500": "破坏军事通信案", "01030851": "提供虚假证明文件案", "01040430": "破坏军婚案", "003000030020001100020001": "冒充亲友", "01050302": "网络诈骗案"}
# biaoqian = {"50625061": "涉黑恶", "50620001": "盗窃", "50620030": "诈骗", "50620005": "伤害", "50620004": "涉赌", "50620003": "涉毒", "50620002": "涉黄", "50620008": "双抢", "50620012": "涉学生", "50620010": "涉枪", "50620011": "涉外国人", "50620014": "涉刀", "50620013": "涉疆", "50620007": "人员失踪"}
# j = 0
# k = 0
# b = 0
# with open("result4.txt", 'w') as f:
#     for i in range(len(texts_bl)):
#         if labels_right1[i] == labels_predictor1[i]:
#             s = 'right1'
#             j += 1
#             if labels_right2[i] == labels_predictor2[i]:
#                 s = 'both-right'
#                 b += 1
#                 k += 1
#         elif labels_right2[i] == labels_predictor2[i]:
#             s = 'right2'
#             k += 1
#         else:
#             s = 'false'
#         # dd = labels_predictor1[i]
#         try:
#             f.write((jq_type[a1] for a1 in labels_right1[i]) + "\t" + (jq_type[a2] for a2 in labels_predictor1[i]) + "\t" +
#                     (biaoqian[a3] for a3 in labels_right2[i]) + "\t" + (biaoqian[a4] for a4 in labels_predictor2[i]) + "\t"
#                     + s + "\t" + texts_bl[i])
#             f.write('\n')
#         except:
#             pass
#     f.write(str(j / len(texts_bl)))
#     f.write('\n')
#     f.write(str(k / len(texts_bl)))
#     f.write('\n')
#     f.write(str(b / len(texts_bl)))
    
# j = 0
# k = 0
# b = 0
# with open("result_source.txt", 'w') as f:
#     for i in range(len(texts_bl)):
#         if labels_right1[i] == labels_predictor1[i]:
#             s = 'right1'
#             j += 1
#         if labels_right2[i] == labels_predictor2[i]:
#             s = 'right2'
#             k += 1
#         if labels_right1[i] == labels_predictor1[i] and labels_right2[i] == labels_predictor2[i]:
#             s = 'both-right'
#             b += 1
#         if labels_right1[i] != labels_predictor1[i] and labels_right2[i] != labels_predictor2[i]:
#             s = 'false'
#         # dd = labels_predictor1[i]
#         try:
#             f.write(labels_right1[i] + "\t" + labels_predictor1[i] + "\t" + "\t" + labels_right2[i] + "\t" +
#                     labels_predictor2[i] + "\t" + s)
#             f.write('\n')
#         except:
#             pass
#     f.write(str(j/len(texts_bl)))
#     f.write('\n')
#     f.write(str(k/len(texts_bl)))
#     f.write('\n')
#     f.write(str(b/len(texts_bl)))